[
    {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
    "category_id": "01",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_enroll": 488,
    "department": "Mechanical Engineering",
    "title": "Biomechanics",
    "author": {
      "name": "Jimmy Dane",
      "starting_date": "2023-12-01 11:00:00",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "image_url": "https://images.squarespace-cdn.com/content/v1/54e34092e4b043f1c9a46c60/1440371725649-HQBXZ44USZ92N2UZU24L/image-asset.jpeg",
    "details": "The biomechanics biomaterials and biological materials groups cover a wide range of research topics from cardiovascular engineering (Mongrain), voice production (Mongeau), bio-devices (Liu), mechanics of biological materials and bio-inspiration and musculoskeletal biomechanics with a focus on spine (Driscoll). Current research projects involve the design of new vascular stents and catheters; structural and multi-objective optimization of stent-like cages for rotating catheter protection; characterization of biological tissue; models of voice production; design, construction and evaluation of implants for vocal fold alteration and reconstruction; numerical simulations of laryngeal flows (CFD); deformation and fracture of bone, teeth, seashells and fish scales as inspiration for new material designs, bio-inspired composites, glass and ceramics for applications in bioengineering, touchscreens, impact-proof windows and protective systems. Our primary facility is the Biomechanics Laboratory in the Macdonald Engineering Building of the downtown McGill campus. The laboratory houses a PIV system from TSI, a rheometer from Bohlin, a pulsatile pump from Harvard Apparatus, a Bio-Pump from Medtronic, roller pumps from Masterflex, ELF3200 mechanical tester for soft tissues from Enduratec, high-precision pressure gages, EMF flow meters, and various modeling software (Fidap, Matlab, Labview, Ansys, Pro-E, ICEM, Femlab). Facilities involved with voice production contain a Dantec time-resolved PIV system, a Dantec hot-wire anemometry system, one Dantec LDA, one Varian gas chromatograph, one Agilent VXI data acquisition system, one Polytec LDV system with both standard and fiber optic heads, one B&K sound level meter, microphones, accelerometers, pressure and flow transducers, computers, and software (Abaqus, Fluent, Comsol, Power Flow, Solid Works). The characterization of the structure, properties and mechanics of a variety of biological materials is performed with a suite of loading stages with in-situ imaging capabilities. Research funding is primarily contributed by the federal and provincial governments through CIHR, NSERC, CFI, NIH, FRSQ and FRQNT and industrial partners, such as Medtronic, Baylis Medical, Coroneo Medical and Opsens Inc."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2bb6b",
    "category_id": "02",
    "rating": { "number": 4.8, "badge": "Excellent" },
    "total_enroll": 658,
    "department": "Mechanical Engineering",
    "title": "Design and Manufacturing",
    "author": {
      "name": "Jennifer Wood",
      "starting_date": "2023-12-01 11:00:00",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "image_url": "https://www.einfochips.com/blog/wp-content/uploads/2015/09/Top-10-Contributing-Factors-to-Design-for-Manufacturability.jpg",
    "details": "Several research groups and laboratories at McGill University focus on mechanical design, manufacturing and process management. The mechanical design groups develop integrated design methods that encompass computational synthesis, multi-scale analysis and selection strategies, and they search for particular applications and industrial sectors. Research topics range from optimum design methodology to biomimetic design. The former involves multi-objective and multidisciplinary optimization. The latter is applied to structures and hybrid materials (i.e., cellular solids and composite materials) and biomedical devices (i.e., stents and heart valves, robotic mechanical systems and their mechanical components). The manufacturing and process management researchers focus on various manufacturing processes that occur at the large and micro scale. These include comminution processes, high-speed grinding, laser assisted machining, metal coating, and micro-machining. Current research projects analyze the effects of wear, fretting and abrasion as well as other thermoelastic and dynamic phenomena. Research also includes the improvement of productivity and cycle time for manufacturing activities, with special emphasis on production planning, concurrent engineering, design with remote partners, and change management."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2cc6c",
    "category_id": "03",
    "rating": { "number": 4.7, "badge": "Excellent" },
    "total_enroll": 610,
    "department": "Mechanical Engineering",
    "title": "Aerodynamics and Fluid Mechanics",
    "author": {
      "name": "Presstv",
      "starting_date": "2023-12-10 11:00:00",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "image_url": "https://www.totalassignment.com/uploads/Fluid-Mechanics-Assignment-Help.jpg",
    "details": "The Aerodynamics, Fluids, and Thermal Engineering research groups and laboratories investigate a wide variety of research topics in the field of Fluid Mechanics. Current research projects include boundary layer control, development of computational algorithms for the design and analysis of aerospace vehicles, the study of differential diffusion in a turbulent jet, unsteady aerodynamic studies on wings and airfoils in subsonic and supersonic flows with applications to aero-elastic oscillations control, studies on the next-generation hypersonic air-breathing engines, computational and numerical investigations of compact heat exchangers, and the study of wing tip vortices from fixed and cyclically pitched wings. Facilities include the J. Armand Bombardier 3ft x 4ft Low-Turbulence Subsonic Wind Tunnel at the Aerodynamics Lab, which is being primarily used for the investigation of aircraft wingtip vortices as well as rotorcraft blade-vortex interaction. The lab employs laser/optics flow measurement equipment and multiple hot-film sensor array as well as PIV flow measurement equipment. A state-of-the-art heat transfer lab investigates fluid flow and heat transfer in engineering systems for energy conversion, exchange, and storage. Researchers have access to the McGill High Performance Computing (HPC) centre, which operates one of the most advanced computing and data management facilities in Canada and the world. McGill HPC is equipped with 21000 processing cores with both graphical processing units and Intel Phi accelerators and provides extensive data storage, cloud-computing services, and advanced technical support and HPC consulting to McGill researchers. Research funding is primarily contributed by the federal and provincial governments through NSERC, CFI and FQRNT as well as by industrial partners, such as Bombardier, Pratt & Whitney, Bell Helicopter and a large number of private companies."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2dd6d",
    "category_id": "04",
    "rating": { "number": 4.7, "badge": "Excellent" },
    "total_enroll": 493,
    "department": "Mechanical Engineering",
    "title": "Dynamics and Control",
    "author": {
      "name": "Smith Wade",
      "starting_date": "2023-11-12 11:00:00",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "image_url": "https://t3.ftcdn.net/jpg/02/54/48/76/360_F_254487626_8WQbuRMypsMFrEn7PjMJW18q1DunrUzp.jpg",
    "details": "The Dynamics and Control groups conduct research on aerospace systems, biomechanical dynamics, dynamics of plates and shells, force control, mechatronics, multibody systems, nonlinear dynamics, robotics, space systems and vibrations. Our laboratories possess state-of-the-art research infrastructure and equipment. The funding for our research is primarily provided by federal and provincial government agencies, such as NSERC, FQRNT, CFI, CSA, and numerous industrial companies."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ee6e",
    "category_id": "05",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_enroll": 533,
    "department": "Mechanical Engineering",
    "title": "Combustion and Energy Systems",
    "author": {
      "name": "Smith Wade",
      "starting_date": "2023-11-15 11:00:00",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "image_url": "https://www.pv-magazine.com/wp-content/uploads/2019/06/Water_Electrolysis.jpg",
    "details": "The Combustion and Energy Systems research groups conduct fundamental and applied research on problems in combustion, shock wave physics, heat transfer, and compressible gas dynamics. Current research projects involve the combustion of alternative liquid fuels for automotive and aircraft propulsion; super-adiabatic combustion; combustion of solid particles with water for hydrogen production; particle combustion in air and fuel-air mixtures; thermal energy storage systems; loop heat pipes; heat transfer enhancement using microencapsulated, phase-change slurries; porous media; cooling of net-book computers; ultra-compact heat exchangers; optimization of heat transfer devices; fundamental propagation mechanisms of shock waves; detonations and explosions; computational modeling of hypersonic aerodynamics; high-speed propulsion; oblique-detonation combustion for scramjet engines; thermo-acoustics; and combustion noise. Our primary facilities include the Alternative Fuels Laboratory, the Shock Wave Physics Group and the Heat Transfer Laboratory. The Alternative Fuels Laboratory is equipped with state-of-the-art laser diagnostic equipment (e.g., velocimetry and species diagnostics) for the study of the combustion of liquid biofuels for automotive and aircraft applications. It has equipment for gas chromatography and thermal gravimetric analysis, which are used for research on chemical reactions and product compositions. The Shock Wave Physics Group has equipment for the study of high-speed turbulent deflagration and detonation phenomena. For instance, there are high-speed photographic equipment, shock and detonation tubes, blast chambers, combustion synthesis apparatus, and solid particle combustion facilities. The Heat Transfer Laboratory has equipment and rigs for the study of fluid flow and heat transfer in interrupted change slurries. This includes surface ducts, mini-channels, porous media, solid-liquid phase change systems, loop heat pipes, and closed-loop thermo-siphons operating with microencapsulated phase. Thermo-acoustic cooling equipment includes a gas chromatography system, NC water heaters, and accelerometers. Our groups have access to the CLUMEQ supercomputer system for large-scale simulations of high-speed and reacting flows. The research is funded primarily by federal and provincial government programs, such as NSERC, CFI and FQRNT. The majority of our projects are conducted in collaboration with industrial and governmental partners, such as Pratt & Whitney, Rolls Royce, Intel, Martec Ltd., Allen Vanguard and the Canadian Space Agency."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ff6f",
    "category_id": "06",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "total_enroll": 580,
    "department": "Mechanical Engineering",
    "title": "Materials and Structures",
    "author": {
      "name": "Hengcha Pain",
      "starting_date": "2023-12-15 11:00:00",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "image_url": "https://d33wubrfki0l68.cloudfront.net/4990f389ae7068c3ebd284629fc6954289458227/99711/assets/img/engineering/strength-of-materials.jpg",
    "details": "The materials and structures group focuses on the development and the optimization of materials, processes, and devices used for operations in extreme environments and special applications. Our activities range from optimizing composite fabrication processes; designing, analysing, fabricating and testing high performance composite structures for aerospace, automotive, consumer products and sports equipment; devising novel designs for materials and structures inspired by nature; developing advanced materials and devices for MEMS used for sensing and energy harvesting; conducting fundamental studies on the mechanics of nanocomposite thin films and the micromechanics of deformation and fracture in biological materials; multiscale analysis; the design and optimization of cellular solids and deployable microstructures; and the process modelling and development of polymer nanocomposites. Examples of recent projects include: the helicopter component design, automotive body panels, new fabrication processes for composite airframe structures, composite bicycle components, natural fiber musical instruments, micro-fuel cells and micro-engines for energy harvesting, ultra-light lattice materials for aerospace structural components, fracture mechanics in natural armor systems and bio-inspired composite materials. Our facilities include universal load testing machines and custom-made pneumatic fatigue testing jigs that assess the mechanical performance of materials and structures. Temperature and rate dependence of materials are investigated with state-of-the-art equipment. For instance, there are Differential Scanning Calorimeters (DSC), Thermo Mechanical Analyzers (TMA), Rheometers, and Dynamic Mechanical Analyzers (DMA). Our research groups use a drop impact tower and a custom gas gun to investigate the responses of materials at higher strain rates. We analyze the mechanics of deformation and fracture of materials with a small-scale (Hysitron nanoindenter), and in-situ techniques (where the micromechanics of deformation and fracture are monitored with optical, electron or atomic force microscopes) as well. As for the analysis of the vibration and damping of MEMS components, we use a vacuum-compatible platform equipped with a laser Doppler vibrometer. Lastly, the study of our manufacturing processes is based on the use of hot presses, ovens and a vacuum assisted resin transfer molding cell. Micromachining and nanoscale patterning are performed in the multi-user Nanotools Microfabrication facility at McGill University. To characterize the structure of our materials, this laboratory houses optical microscope, two atomic force microscopes (including an environmental AFM), and an X-ray imaging system. Aside from the Nanotools Microfabricatio facility, our group has access to the McGill Facility for Electron Microscopy (SEM, TEM), the Bone Centre (microCT), and CLUMEQ supercomputing facilities to model and predict the influence of microstructures on deformation and fracture processes. Our research is primarily funded by federal and provincial associations, such as NSERC, CFI, FQRNT, CRC, CRIAQ, CREPEC, and CIHR. Industries such as Bombardier, Pratt & Whitney, Bell Helicopter, General Motors of Canada, and Allen Vanguard, are moreover significant contributers."
  }
]